name: "resnet_cifar10"
layers{
  name: "data"
  type: "Data"
  top: "data"
  input_param { shape: { dim: 1 dim: 3 dim: 32 dim: 32 } }
}
layers{
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  conv_param {
    num_output: 32
    pad: 2
    kernel: 5
    stride: 1    
  }
}

layers{
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: "max"
    kernel: 2
    stride: 2
  }
}

layers {
  name: "relu1"
  type: "ReLU"
  bottom: "pool1"
  top: "pool1"
}

layers {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  conv_param {
    num_output: 32
    pad: 2
    kernel: 5
    stride: 1  
  }
}
layers {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}

layers {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: "ave"
    kernel: 2
    stride: 2
  }
}

layers {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  conv_param {
    num_output: 64
    pad: 2
    kernel: 5
    stride: 1    
  }
}
layers {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layers {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3"
  top: "pool3"
  pooling_param {
    pool: "ave"
    kernel: 2
    stride: 2
  }
}
layers {
  name: "ip1"
  type: "InnerProduct"
  bottom: "pool3"
  top: "ip1"
  innerproduct_param {
    num_output: 64      
  }
}
layers {
  name: "relu4"
  type: "ReLU"
  bottom: "ip1"
  top: "ip1"
}
layers {
  name: "ip2"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2"
  innerproduct_param {
    num_output: 10    
  }
}